app/Http/Controllers/ArticuloController.php

    public function index (){

        $arts= Articulo::orderBy ('id', 'ASC')
            ->paginate(15);
        $cates= Categoria::all();
        $proves= Proveedor::all();
        $imeis= Imei::all();
/* <<<<<<< HEAD
        //dd($arts);
    	return view ('articulos.index', compact ('arts', 'cates', 'proves', 'imeis'));
======= */
        $numeros= Numero::all();
---
select * from `articulos` order by `id` asc limit 15 offset 0
select count(*) as aggregate from `articulos`
select * from `categorias`
select * from `proveedors`
select * from `imeis`
select * from `numeros`

    public function create(){

        $cates= Categoria::all();
        $proves= Proveedor::all();
---
select * from `categorias`
select * from `proveedors`

    public function search(Request $request){

        $nombre= $request->get('nombre');
        $codigo= $request->get('codigo');
        $marca= $request->get('marca');
        $modelo= $request->get('modelo');
        $precioi= $request->get('precioi');
        $preciof= $request->get('preciof');
        $categorias= $request->get('categorias');
        $proveedores= $request->get('proveedores');

        $arts= Articulo::orderBy ('id', 'ASC')
            ->nombre ($nombre)
            ->codigo ($codigo)
            ->marca ($marca)
            ->modelo ($modelo)
            ->precioi ($precioi)
            ->preciof ($preciof)
            ->categorias ($categorias)
            ->proveedores ($proveedores)
            ->paginate (1500);

        $cates= Categoria::all();
        $proves= Proveedor::all();
        $imeis= Imei::all();
---
select * from `categorias`
select * from `articulos` where `categorias_id` like '4' order by `id` asc limit 1500 offset 0
select count(*) as aggregate from `articulos` where `categorias_id` like '4'
select * from `proveedors`
select * from `imeis`