app/Http/Controllers/ClienteController.php

select * from `clientes` limit 15 offset 0
select count(*) as aggregate from `clientes`
---
    public function index()
    {
        $clie= Cliente::paginate(15);

select * from `clientes` where `clientes`.`id` = '1' limit 1
---
    public function edit($id)
    {
        $clie= Cliente::FindOrFail($id);

select * from `clientes` where `clientes`.`id` = '1' limit 1
---
    public function update($id, Request $request ){

        $clie= Cliente::FindOrFail($id);