app/Http/Controllers/UsuarioController.php

    public function index (){

        $users= User::paginate(5);
        $roles= Role::all();
---
select * from `users` limit 5 offset 0
select count(*) as aggregate from `users`
select * from `roles`