app/Models/Articulo.php

    public function getLastArt(){
        $art= Articulo::all();
---
select * from `articulos`