app/Models/Caja.php

select * from `facturas` where date(`created_at`) = '2022-02-28'
---
    public function totalDia(){

        //calculo total diario ef + tarj - gastos
        $totFact= 0;
        $gas= new Gasto();
        $totGas= $gas->total();
        //dd($totGas);

        $todas= Factura::whereDate('created_at', '=', Carbon::now()->format('Y-m-d'))->get();

select * from `cajas` where `users_id` = 1
---
    public function montoInicial(){

        //busco si caja inicial para este user
        $cajai= Caja::where('users_id', auth()->id())->get();

select * from `cajas`
---
    public function estado(){

        $caja= Caja::all();

select * from `cajas`
---
     public function status($resp){

        $caja= Caja::all();