app/Models/Gasto.php

    public function total(){

        $gas= Gasto::all();
---
select * from `gastos`